# In Memory Cache

## Описание

Разработать приложение имплементацию in-memory [Redis](https://redis.io/) кеша.

## Требования

- Писать код можно на любом языке программирования;
- Предоставить инструкцию по запуску приложения.

### Ссылки:

- Команды Redis: https://redis.io/commands/

## Задание

- Клиент и Cервер tcp(telnet)/REST API;
- Реализация Key-value хранилища строк, списков, словарей;
- Реализовать операторы: GET, SET, DEL, KEYS, HGET, HSET, LGET, LSET;
- Реализовать сохранение на диск.

### Дополнительное задание:

- Возможность установить TTL на каждый ключ.

