# WS Comet

## Описание

Реализовать простое клиент-серверное приложение, которое может общаться с помощью WebSocket и Long Polling.

## Требования

### Технологии:

- Node.js/C#/Go;
- Express/NestJS/.NET.

### Ссылки:

- API валют: https://exchangeratesapi.io/

## Задание

- Реализовать сервер, запрашивающий информацию о валютах с API получения валют каждые 15 секунд.
- Реализовать клиентское приложение, которое подключается к серверу по WebSocket, если соединение закрывется, то необходимо перейти на Long Polling, а затем опять на WS по возможности.

